[TacticalC4 X2GrenadeTemplate]
FriendlyName="C4"
FriendlyNamePlural="C4"
BriefSummary="Conventional explosive with a remote trigger"
TacticalText="Conventional explosive with a remote trigger"

[TacticalX4 X2GrenadeTemplate]
FriendlyName="X4"
FriendlyNamePlural="X4"
BriefSummary="Advanced composite explosive with a remote trigger"
TacticalText="Advanced composite explosive with a remote trigger"

[TacticalE4 X2GrenadeTemplate]
FriendlyName="E4"
FriendlyNamePlural="E4"
BriefSummary="Advanced composite explosive enriched with elerium"
TacticalText="Advanced composite explosive enriched with elerium"

[MusashiPlantTacticalC4 X2AbilityTemplate]
LocFriendlyName="Plant C4"
LocLongDescription="A C4 explosive device with a remote trigger. Planting C4 is a standard non turn ending action and does not break concealment."
LocHelpText="Plant a C4 device at your current location"
LocFlyOverText="Plant C4"
LocPromotionPopupText=""

[MusashiPlantTacticalX4 X2AbilityTemplate]
LocFriendlyName="Plant X4"
LocLongDescription="A X4 explosive device with a remote trigger. Planting X4 is a standard non turn ending action and does not break concealment."
LocHelpText="Plant a X4 device at your current location"
LocFlyOverText="Plant X4"
LocPromotionPopupText=""

[MusashiPlantTacticalE4 X2AbilityTemplate]
LocFriendlyName="Plant E4"
LocLongDescription="A E4 explosive device with a remote trigger. Planting E4 is a standard non turn ending action and does not break concealment."
LocHelpText="Plant a E4 device at your current location"
LocFlyOverText="Plant E4"
LocPromotionPopupText=""

[MusashiTriggerTacticalC4 X2AbilityTemplate]
LocFriendlyName="Trigger C4"
LocLongDescription="Trigger all previous planted C4 charges. This is a free action and does not break your concealment. You are not allowed to trigger explosives the same turn you planted it."
LocHelpText="Triggers all previous planted C4 charges."
LocFlyOverText="Trigger C4 explosives"

[MusashiTriggerTacticalX4 X2AbilityTemplate]
LocFriendlyName="Trigger X4"
LocLongDescription="Trigger all previous planted X4 charges. This is a free action and does not break your concealment. You are not allowed to trigger explosives the same turn you planted it."
LocHelpText="Triggers all previous planted X4 charges."
LocFlyOverText="Trigger X4 explosives"

[MusashiTriggerTacticalE4 X2AbilityTemplate]
LocFriendlyName="Trigger E4"
LocLongDescription="Trigger all previous planted E4 charges. This is a free action and does not break your concealment. You are not allowed to trigger explosives the same turn you planted it."
LocHelpText="Triggers all previous planted E4 charges."
LocFlyOverText="Trigger E4 explosives"